githubgravin/uta_stm32/User/sdcard/bsp_sdfs_app.c
#include "bsp_sdfs_app.h"
#include "bsp_sdio_sdcard.h"
#include "ff.h"
#include "bsp_usart1.h"	
#include <stdio.h>
#include "wav.h"
#include "bsp_ili9341_lcd.h"
#include "stm32f10x.h"

FATFS myfs[2];                 // Work area (file system object) for logical drive
DIR recdir;
FIL myfsrc, myfdst;            // file objects
FRESULT myres;                 // FatFs function common result code
BYTE mybuffer[512];            // file copy buffer
BYTE my_latest_buffer[512];
uint8_t mystring[512]="this is a MicroSD demo base on fatfs";
UINT mybr, mybw;               // File R/W count
int mya = 0;
char mypath[512]="0:";         // 一定要初始化为0:


void Sd_fs_init(void)
{
    /* SD卡中断初始化 */
		SDIO_NVIC_Configuration();
		/* SD 卡硬件初始化，初始化盘符为0 */	 
   f_mount(0,&myfs[0]);	       
	
}

void Sd_fs_test(void)
{
    int count=0;
		    
    SDIO_NVIC_Configuration();
    disk_initialize( 0 );	     /* SD 卡硬件初始化 */

    f_mount(0, &myfs[0]);
    myres = f_open( &myfsrc , "0:/my__Demo.TXT" ,/* FA_CREATE_NEW |*/ FA_WRITE);
    
    if ( myres == FR_OK )
    { 
        /* Write buffer to file */
        myres = f_write(&myfsrc, mystring, sizeof(mystring), &mybr);    
        f_close(&myfsrc);      
    }    
    else if ( myres == FR_EXIST )  //如果文件已经存在
    {	
    }    
    
    myres = f_open(&myfsrc, "0:/my__Demo.TXT", FA_OPEN_EXISTING | FA_READ); /* 打开文件 */	  //ok    
    mybr = 1;
    mya = 0;    
    
    for (;;) 
    {        
        for ( mya=0; mya<512; mya++ ) 	/* 清缓冲区 */
            mybuffer[mya]=0;
        
     	  myres = f_read( &myfsrc, mybuffer, sizeof(mybuffer), &mybr ); /* 将文件里面的内容读到缓冲区 */
        sprintf( (char*)&my_latest_buffer[count*512], "%s" , mybuffer );	  //打印到缓冲区        
        count++;							
        if (myres || mybr == 0) break;   // error or eof        	    	
    }    
    f_close(&myfsrc);	 /* 关闭打开的文件 */    	    
}


/*******************************************************************************
* Function Name  : Sdfs_new
* Description    : 兴建一个文件并写入数据  
* Input          : new_file_name--兴建文件的名称  
*				   write_buffer--写入文件的数据缓冲区地址  
*				   buffer_size--缓冲区大小
* Output         : None
* Return         : 0(success)  1(file existed )  -1(fail)
* Attention		 : None
*******************************************************************************/           
int Sdfs_new(BYTE *new_file_name, BYTE *write_buffer, BYTE buffer_size)
{
    BYTE name_buffer[50];
    sprintf((char*)name_buffer,"0:%s",new_file_name);
    
    f_mount(0, &myfs[0]);
    myres = f_open( &myfsrc , (char*)name_buffer , FA_CREATE_NEW | FA_WRITE);
    
    if ( myres == FR_OK ) 
    { 
        
        myres = f_write(&myfsrc, write_buffer,buffer_size, &mybr); //写入数据   
        f_close(&myfsrc);
        
        return 0;      
    }
    
    else if ( myres == FR_EXIST )  //如果文件已经存在
    {
        return FR_EXIST;	 
    }
    
    else
    {
        return -1;
    }
    
}


/*******************************************************************************
* Function Name  : Sdfs_write
* Description    : 对文件写入数据  
* Input          : new_file_name--下入数据文件的名称  
*				   write_buffer--写入文件的数据缓冲区地址  
*				   buffer_size--缓冲区大小
* Output         : None
* Return         : 0(success)   -1(fail)
* Attention		 : None
*******************************************************************************/            
int Sdfs_write(BYTE *write_file_name, BYTE *write_buffer, BYTE buffer_size)
{
    BYTE name_buffer[50];
    sprintf((char*)name_buffer,"0:%s",write_file_name);
    
    f_mount(0, &myfs[0]);
    myres = f_open( &myfsrc , (char*)name_buffer ,FA_WRITE);
    
    if ( myres == FR_OK )  
    { 
        /* Write buffer to file */	
        myres = f_write(&myfsrc, write_buffer,buffer_size, &mybr); //写入数据   
        f_close(&myfsrc);
        
        return 0;      
    }
    else 
	if(myres == FR_NO_FILE)	 //如果没有该文件
	{
        return FR_NO_FILE;
    } 
    else	
	return -1;
}



/*******************************************************************************
* Function Name  : Sdfs_read
* Description    : 从一个文件读出数据到缓冲区 
* Input          : read_file_name--文件的名称  
*				   				save_buffer--数据需要保存的地址 
* Output         : None
* Return         : 0(success)  -1(fail)
* Attention		 : None
*******************************************************************************/ 
int Sdfs_read(BYTE *read_file_name, BYTE *save_buffer)
{
    
    int count=0;
    BYTE name_buffer[50];
    sprintf((char*)name_buffer,"0:%s",read_file_name);
    Sd_fs_init();
    f_mount(0, &myfs[0]);
    myres = f_open(&myfsrc , (char*)name_buffer , FA_OPEN_EXISTING | FA_READ);
    
    if ( myres == FR_OK ) 
    { 
        for (;;) 
        {
            
            for ( mya=0; mya<512; mya++ ) 	/* 清缓冲区 */
                mybuffer[mya]=0;
            
            myres = f_read( &myfsrc, mybuffer, sizeof(mybuffer), &mybr ); /* 将文件里面的内容以512字节为单位读到本地缓冲区 */
            sprintf((char*)&save_buffer[count*512],"%s",mybuffer);					//打印到用户指定的缓冲区缓冲区
            
            count++;							
            if (myres || mybr == 0) break;   // error or eof        	    	
        }  	
        
        return 0;
    }
    
    else
        return -1;
    
    
}

/*******************************************************************************
* Function Name  : GetGBKCode_from_sd
* Description    : 从SD卡字库中读取自摸数据到指定的缓冲区 
* Input          : pBuffer---数据保存地址  
*				   					c--汉字字符低字节码 
* Output         : None
* Return         : 0(success)  -1(fail)
* Attention		 	 : None
*******************************************************************************/ 
int GetGBKCode_from_sd(unsigned char* pBuffer,const unsigned char * c)
{ 
    unsigned char High8bit,Low8bit;
    unsigned int pos;
    High8bit=*c;     /* 取高8位数据 */
    Low8bit=*(c+1);  /* 取低8位数据 */
	
//  printf("%d ,%d\r\n",High8bit,Low8bit);
//	printf("%x ,%x\r\n",High8bit,Low8bit);
	
    pos = ((High8bit-0xa0-16)*94+Low8bit-0xa0-1)*2*16 ;	
    f_mount(1, &myfs[0]);
    myres = f_open(&myfsrc , "0:mp3player/HZLIB.bin", FA_OPEN_EXISTING | FA_READ);
    
    if ( myres == FR_OK ) 
    {
        f_lseek (&myfsrc, pos);		//指针偏移
        myres = f_read( &myfsrc, pBuffer, 32, &mybr );		 //16*16大小的汉字 其字模 占用16*2个字节
        
        f_close(&myfsrc);
        
        return 0;  
    }    
    else
        return -1;    
}

/**
  * @brief  主函数
  * @param  无  
  * @retval 无
  */

//void recoder_player(void){ 
//			u16 index=0;
//			u16 idx=0;
//			u32 sectorsize=500;
//			u8 *pname=NULL;
//			WavHeader *wavhead=NULL;
//			u8 *recbuf=NULL;
//			recbuf=malloc(32);
//			wavhead=(WavHeader*)malloc(sizeof(WavHeader));
//	    pname=malloc(30);
//			f_mount(0,&myfs[0]);
//			GPIO_SetBits(GPIOB,GPIO_Pin_9);
////				GPIOB->BSRR = GPIO_Pin_9;
//			GPIO_ResetBits(GPIOB,GPIO_Pin_10);
////				GPIOB->BRR = GPIO_Pin_10;	
//			while(f_opendir(&recdir,"0:/RECORDER")){
//		
//			LCD_DispStr(180, 120, (uint8_t *)"FILE NOT ESIST", RED);  
//				Delay(0x0FFFFF);
//				f_mkdir("0:/RECORDER");		                       
//      }  
//      while(index<0XFFFF){  
//        sprintf((char*)pname,"0:RECORDER/REC%05d.wav",index);  
//			
//        myres=f_open(&myfsrc,(const TCHAR*)pname,FA_READ);
//        if(myres==FR_NO_FILE) break;      
//        index++;  
//       }  	
//		//	printf("%s\r\n",pname+11); 			
//			//LCD_Clear(0, 0, 320,240, BACKGROUND);	 
//			LCD_DispStr(180, 120, (uint8_t *)pname+11, RED);  
//			Recoder_wav_init(wavhead);
//			wavhead->ChunkSize=500*512+36;
//			wavhead->SubChunkDataSize=500*512;
//			myres = f_open(&myfsrc,(const TCHAR*)pname, FA_CREATE_ALWAYS | FA_WRITE);
//		  if ( myres == FR_OK )
//		  {
//			 myres = f_write(&myfsrc,(const void*)wavhead, sizeof(WavHeader), &mybw);
//			// f_close(&myfsrc);      
//						while(sectorsize>0){
//										while(idx<512){
//												recbuf[idx++]=ADC_ConvertedValue[1]&0xff;
//												recbuf[idx++]=ADC_ConvertedValue[1]>>8;
//												//DelayUS(125);
//											//	printf("%d...%d...",*recbuf,*(recbuf+1));
//										}
//										idx=0;
//										myres=f_write(&myfsrc,recbuf,512,&mybw);										
//										sectorsize--;
//							}
//        			f_close(&myfsrc);  
//			 }						
//		  f_mount(0, NULL);

//			free(pname);
//			free(wavhead);
//			free(recbuf);
////			GPIO_SetBits(GPIOB,GPIO_Pin_10);
////			GPIO_ResetBits(GPIOB,GPIO_Pin_9);

//			}
